{
    "chapter": 11,
    "verse": 45,
    "translation": "BG 11.45:Having seen Your universal form that I had never seen before, I feel great joy. And yet, my mind trembles with fear. Please have mercy on me and again show me Your pleasing form, O God of gods, O Abode of the universe.",
    "commentary": "There are two kinds ofbhakti—aiśhwaryabhaktiandmādhuryabhakti.Aiśhwaryabhaktiis that where the devotee is motivated to engage in devotion by contemplating upon the almighty aspect of God. The dominant sentiment inaiśhwaryabhaktiis of awe and reverence. In such devotion, the feeling of remoteness from God and the need for maintaining propriety of conduct is always perceived. Examples ofaiśhwaryabhaktiare the residents of Dwaraka and the residents of Ayodhya, who worshipped Shree Krishna and Lord Ram respectively as their kings. Ordinary citizens are highly respectful and obedient toward their king, although they never feel intimate with him. Mādhuryabhaktiis that where the devotee feels an intimate personal relationship with God. The dominant sentiment in such devotion is “Shree Krishna is mine and I am his.” Examples ofmādhuryabhaktiare the cowherd boys of Vrindavan who loved Krishna as their friend, Yashoda and Nand baba, who loved Krishna as their child, and thegopīswho loved him as their beloved.Mādhuryabhaktiis infinitely sweeter thanaiśhwaryabhakti. Hence, Jagadguru Shree Kripaluji Maharaj states: sabai sarasa rasa dwārikā, mathurā aru braja māhiñ madhura, madhuratara, madhuratama, rasa brajarasa sama nāhiñ (Bhakti Śhatak verse 70)[v22] “The divine bliss of God is immensely sweet in all his forms. Yet, there is a gradation in it—the bliss of his Dwaraka pastimes is sweet, the bliss of his Mathura pastimes is sweeter, and the bliss of his Braj pastimes is the sweetest.” InMādhuryabhakti, forgetting the almightiness of God, devotees establish four kinds of relationships with Shree Krishna: Dāsya bhāv—Shree Krishna is our Master and I am his servant. The devotion of Shree Krishna’s personal servants, such as Raktak, Patrak, etc. was indāsya bhāv. The sentiment that God is our Father or Mother is a variation ofdāsya bhāvand is included in it. Sakhya bhāv—Shree Krishna is our Friend and I am his intimate companion. The devotion of the cowherd boys of Vrindavan, such as Shreedama, Madhumangal, Dhansukh, Mansukh, etc. was insakhya bhāv. Vātsalya bhāv—Shree Krishna is our Child and I am his parent. The devotion of Yashoda and Nand baba was invātsalya bhāv. Mādhurya bhāv—Shree Krishna is our Beloved and I am his lover. The devotion of thegopīsof Vrindavan was inmādhurya bhāv. Arjun is asakhya bhāvdevotee and relishes a fraternal relationship with the Lord. On seeing the universal form of God, Arjun experienced tremendous awe and reverence, and yet he longed for the sweetness ofsakhya bhāvthat he was used to savoring. Hence, he prays to Shree Krishna to hide the almighty form that he is now seeing and again show his human form."
}