{
    "chapter": 5,
    "verse": 2,
    "translation": "BG 5.2:The Supreme Lord said: Both the path ofkarm sanyās(renunciation of actions) andkarm yog(working in devotion) lead to the supreme goal. Butkarm yogis superior tokarm sanyās.",
    "commentary": "In this verse, Shree Krishna compareskarm sanyāsandkarm-yog.  It is a very deep verse; so let’s understand it one word at a time. Akarm yogiis one who does both, spiritual and social, duties.  Social duties are done with the body while the mind is attached to God.  Jagadguru Kripaluji Maharaj states: sochu mana yaha karm mama saba lakhata hari guru pyāre(Sādhan Bhakti Tattva) “Dear one!  Think always that all your actions are being observed by God and Guru.”  This is thesādhanāofkarm-yog, by which we gradually elevate ourselves from bodily consciousness to spiritual consciousness. Karm sanyāsis for elevated souls, who have already risen beyond the bodily platform.  Akarm sanyāsīis one who discards social duties due to complete absorption in God, and engages entirely in the performance of spiritual duties (devotional service to God).  This sentiment ofkarm sanyāswas nicely expressed by Lakshman, when Lord Ram asked him to fulfill his worldly duties: more sabai eka tumha swāmī, dīnabandhu ura antarayāmī(Ramayan) Lakshman said to Ram, “You are my Master, Father, Mother, Friend, and everything.  I will only fulfill my duty toward You with all my might.  So please do not tell me about any of my bodily duties.” Those who practicekarm sanyāsdo not consider themselves to be the body, and as a result, they do not feel obligated to discharge their bodily duties.  Suchkarm sanyāsīsdedicate their full time and energy to spirituality, whilekarm yogishave to split their time between worldly and spiritual duties.  Thekarm sanyāsīscan thus move much faster toward God, while thekarm yogisare encumbered with social duties. However, in this verse, Shree Krishna extolskarm-yogbeyondkarm sanyāsand recommends it to Arjun as the preferred path.  This is becausekarm sanyāsīsare exposed to a danger.  If, having renounced their duties they cannot absorb their mind in God, they are left neither here nor there.  In India, there are tens of thousands of such sadhus, who felt they were detached, and thus, renounced the world, but their mind was not yet attached to God.  Consequently, they could not experience the divine bliss of the spiritual path.  And so, although wearing the saffron clothes of mendicants, they indulge in grossly sinful activities such as smoking opium.  Only the ignorant mistake their sloth as detachment from the world. On the other hand,karm yogisdo both their worldly duties and spiritual practice.  So if their mind turns away from spirituality, at least they have their work to fall back upon.Karm-yogis thus the safer path for majority of the people, whilekarm sanyāsis only to be pursued under the expert guidance of a Guru."
}