{
    "chapter": 9,
    "verse": 14,
    "translation": "BG 9.14:Always singing My divine glories, striving with great determination, and humbly bowing down before Me, they constantly worship Me in loving devotion.",
    "commentary": "Having said that the great souls engage in His devotion, Shree Krishna now explains how they do bhakti.  He says that devotees become attached tokīrtanas a means of practicing their devotion and enhancing it.  The chanting of the glories of the Lord is calledkīrtan, which is defined as:nāma-līlā-guṇadīnām uchchair-bhāṣhā tu kīrtanam(Bhakti Rasāmṛit Sindhu 1.2.145)  “Singing glories of the Names, Forms, Qualities, Pastimes, Abodes, and Associates of God is calledkīrtan.” Kīrtanis one of the most powerful means of practicing devotion.  It involves the three-fold devotion ofśhravaṇa(hearing),kīrtan(chanting), andsmaraṇa(remembering).  The goal is to fix the mind upon God, but it becomes easier when done alongside with hearing and chanting.  As stated in chapter six, the mind is as restless as the wind, and naturally wanders from thought to thought.  Hearing and chanting engage the knowledge senses in the divine realm, which helps in repeatedly bringing back the mind from its wanderings. Kīrtanhas many other benefits as well.  Often when people practice devotion throughjapa(chanting of mantra or Name of God on rosary beads) or plain meditation, they find themselves overwhelmed by sleep.  However,kīrtanis such an engaging process that it usually drives sleep away.  Also, chanting blocks out distracting sounds from the environment.Kīrtancan be practiced in groups which enables mass participation.  In addition, the mind desires variety, which it gets through the medium ofkīrtanin the form of the Names, Virtues, Pastimes, Abodes, etc. of God.  And sincekīrtaninvolves loud chanting, the divine vibrations of the Names of God make the entire environment auspicious and holy. For all these reasons,kīrtanhas been the most popular form of devotion amongst saints in Indian history.  All the famous bhakti Saints—Soordas, Tulsidas, Meerabai, Guru Nanak, Kabir, Tukaram, Ekanath, Narsi Mehta, Jayadev, Tyagaraja, and others—were great poets.  They composed numerous devotional songs, and through them, they engaged in chanting, hearing, and remembering. The Vedic scriptures particularly extolkīrtanas the simplest and most powerful process of devotion in the present age ofKali. kṛite yad dhyāyato viṣhṇuṁ tretāyāṁ yajato makhaiḥ dwāpare paricharyāyāṁ kalau tad dhari-kīrtanāt(Bhagavatam 12.3.52) “The best process of devotion in the age of Satya was simple meditation upon God.  In the age ofTretā, it was the performance of sacrifices for the pleasure of God.  In the age ofDwāpar, worship of the deities was the recommended process.  In the present age ofKali, it iskīrtanalone.” avikārī vā vikārī vā sarva doṣhaika bhājanaḥ parameṣha padaṁ yāti rāma nāmānukīrtanāt   (Adhyātma Ramayan) “Whether you are full of desires or free from them, devoid of defects or full of them, if you engage inkīrtanof the names of Lord Ram, you will attain the highest destination.” sarva dharma bahirbhūtaḥ sarva pāparatasthathā muchyate nātra sandeho viṣhṇornamānukīrtanāt(Vaiśhampāyan Samhitā) “Even those who are deeply sinful and bereft of religiosity can be saved by the chanting of the names of Lord Vishnu; of this, there is no doubt.” kalijuga kevala hari guna gāhā, gāvata nara pāvahiṅ bhava thāhā(Ramayan) “In this age ofKali, there is one means of salvation.  By engaging in the chanting of the glories of God, one can cross over this material ocean.” However, one must remember that in the process ofkīrtan, hearing and chanting are helpers.  The essence is to remember God.  If we leave it out, thekīrtanwill not purify the mind.  Thus, Shree Krishna says here that His devotees dokīrtan, while constantly engaging the mind in thinking of Him.  They practice this with great determination for the purification of the mind."
}