{
    "chapter": 4,
    "verse": 30,
    "translation": "BG 4.29-30:Still others offer as sacrifice the outgoing breath in the incoming breath, while some offer the incoming breath into the outgoing breath. Some arduously practiceprāṇāyāmand restrain the incoming and outgoing breaths, purely absorbed in the regulation of the life-energy. Yet others curtail their food intake and offer the breath into the life-energy as sacrifice. All these knowers of sacrifice are cleansed of their impurities as a result of such performances.",
    "commentary": "Some persons are drawn to the practice ofprāṇāyām, which is loosely translated as “control of breath.” This involves: Pūrak—the process of drawing the breath into the lungs. Rechak—the process of emptying the lungs of breath. Antar kumbhak—holding the breath in the lungs after inhalation. The outgoing breath gets suspended in the incoming breath during the period of suspension. Bāhya kumbhak—keeping the lungs empty after exhalation. The incoming breath gets suspended in the outgoing breath during the period of suspension. Both thekumbhaksare advanced techniques and should only be practiced under the supervision of qualified teachers, else they can cause harm. Yogis who are inclined toward the practice ofprāṇāyāmutilize the process of breath control to help tame the senses and bring the mind into focus. Then they offer the controlled mind in the spirit ofyajñato the Supreme Lord. Prāṇis not exactly breath; it is a subtle life force energy that pervades the breath and varieties of animate and inanimate objects. The Vedic scriptures describe five kinds ofprāṇasin the body—prāṇ, apān, vyān, samān, udān—that help regulate various physiological bodily functions. Amongst these,samānis responsible for the bodily function of digestion. Some people may also be inclined toward fasting. They curtail their eating with the knowledge that diet impacts character and behavior. Such fasting has been employed as a spiritual technique in India since ancient times and also considered here a form ofyajña. When the diet is curtailed, the senses become weak and thesamān, which is responsible for digestion, is made to neutralize itself. This is the nature of the sacrifice that some people perform. People perform these various kinds of austerities for the purpose of purification. It is desire for gratification of the senses and the mind which leads to the heart becoming impure. The aim of all these austerities is to curtail the natural propensity of the senses and mind to seek pleasure in material objects. When these austerities are performed as a sacrifice to the Supreme, they result in the purification of the heart (as mentioned before, the word “heart” is often used to refer to the internal machinery of the mind and intellect)."
}