{
    "chapter": 4,
    "verse": 20,
    "translation": "BG 4.20:Such people, having given up attachment to the fruits of their actions, are always satisfied and not dependent on external things. Despite engaging in activities, they do not do anything at all.",
    "commentary": "Actions cannot be classified by external appearances. It is the state of the mind that determines what is inaction and action. The minds of enlightened persons are absorbed in God. Being fully satisfied in devotional union with him, they look upon God as their only refuge and do not depend upon external supports. In this state of mind, all their actions are termed asakarm, or inactions. There is a beautiful story in the Puranas to illustrate this point. Thegopīs(cowherd women) of Vrindavan once kept a fast. The ceremony of breaking the fast required them to feed a sage. Shree Krishna advised them to feed Sage Durvasa, the elevated ascetic, who lived on the other side of River Yamuna. Thegopīsprepared a delicious feast and started off, but found the river was very turbulent that day, and no boatman was willing to ferry them across. Thegopīsasked Shree Krishna for a solution. He said, “Tell River Yamuna that if Shree Krishna is anakhaṇḍ brahmacharī(perfectly celibate since birth), it should give them way.” Thegopīsstarted laughing, because they felt that Shree Krishna used to dote upon them, and so there was no question of his being anakhaṇḍ brahmacharī.Nevertheless, when they requested River Yamuna in that manner, the river gave them way and a bridge of flowers manifested for their passage across. Thegopīswere astonished. They went across to theāśhramof Sage Durvasa. They requested him to accept the delicious meal they had brought for him. Being an ascetic, he ate only a small portion, which disappointed thegopīs. So, Durvasa decided to fulfill their expectations, and using his mystic powers, he ate everything they had brought. Thegopīswere amazed to see him eat so much, but were very pleased that he had done justice to their cooking. Thegopīsnow asked Durvasa for help to cross the Yamuna and return to the other side. He replied, “Tell River Yamuna that if Durvasa has not eaten anything today exceptdoob(a kind of grass which was the only thing Durvasa used to eat), the river should give way.” Thegopīsagain started laughing, for they had seen him eat such an extravagant meal. Yet to their utmost surprise, when they beseeched River Yamuna in that manner, the river again gave them way. Thegopīsasked Shree Krishna the secret behind what had happened. He explained that while God and the Saints appear to engage in material activities externally, internally they are always transcendentally situated. Thus, even while doing all kinds of actions, they are still considered to be non-doers. Although interacting with thegopīsexternally, Shree Krishna was anakhaṇḍ brahmacharīinternally. And though Durvasa ate the delectable meal offered by thegopīs, internally his mind only tasted thedoobgrass. Both these were illustrations of inaction in action."
}